---
kind: type
id: T:Autodesk.Revit.DB.CurveArrayIterator
source: html/f2e97568-6047-1822-7d49-ccd50de32dd4.htm
---
# Autodesk.Revit.DB.CurveArrayIterator

An iterator to a curve array.

## Syntax (C#)
```csharp
public abstract class CurveArrayIterator : APIObject,
	IEnumerator
```